driver-tests/bpelse/misc/MiscJbi/test/TaakService/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:taak="http://localhost/prjTask/TaakService">
  <soapenv:Body>
    <taak:createTaakRequest>
      <dossierId>123</dossierId>
      <taakType>x</taakType>
    </taak:createTaakRequest>
  </soapenv:Body>
</soapenv:Envelope>